{
  "all": [
    {
      "first_name": "Richard",
      "last_name": "Feldman",
      "position": "Director of Engineering",
      "company": "NoRedInk",
      "description": "Richard is the author of “Elm in Action” from Manning Publications, and the instructor for the Frontend Masters 2-Day Elm Workshop. When he’s not writing about Elm, teaching Elm, speaking about Elm, or co-hosting the San Francisco Elm meetup, he likes to take a break from his job at NoRedInk (where frontend programmers spend almost almost all their coding time writing production Elm code), by kicking back and working on some of his open source Elm projects.",
      "image_src": "richard_feldman",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/rtfeldman"
        },
        {
          "type": "github",
          "url": "https://github.com/rtfeldman"
        },
        {
          "type": "linkedin",
          "url": "https://www.linkedin.com/in/rtfeldman"
        }
      ]
    },
    {
      "first_name": "Sarah",
      "last_name": "Drasner",
      "position": "Sr. Cloud Developer Advocate",
      "company": "Microsoft",
      "description": "Sarah is an award-winning speaker, consultant and staff writer at CSS-Tricks. Sarah is also the co-founder of Web Animation Workshops, with Val Head. She’s the author of SVG Animations from O’Reilly and has given a Frontend Masters workshop on Advanced SVG Animations. Sarah is formerly Manager of UX Design & Engineering at Trulia (Zillow).",
      "image_src": "sara_drasner",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/sarah_edo"
        },
        {
          "type": "github",
          "url": "https://github.com/sdras"
        },
        {
          "type": "linkedin",
          "url": "https://www.linkedin.com/in/sarahdrasner"
        }
      ]
    },
    {
      "first_name": "Brian",
      "last_name": "Holt",
      "position": "Staff Engineer",
      "company": "LinkedIn",
      "description": "Brian Holt is a staff engineer at LinkedIn and a former senior user interface engineer at Netflix. He also used to be a freelance JS engineer and teacher for Frontend Masters. Previously he worked as the director of redditgifts front end at reddit and senior UI engineer at Netflix. When not on a Netflix bender or devouring content on reddit, Brian is probably hanging out with his wife and dog, running, traveling, or playing video games. Brian is presently a resident of San Francisco, CA.",
      "image_src": "brian_holt",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/holtbt"
        },
        {
          "type": "github",
          "url": "https://github.com/btholt"
        },
        {
          "type": "linkedin",
          "url": "https://www.linkedin.com/in/btholt"
        }
      ]
    },
    {
      "first_name": "Yoav",
      "last_name": "Weiss",
      "position": "Principal Architect",
      "company": "Akamai",
      "description": "Yoav Weiss focuses on making the Web platform faster by adding performance-related features to browsers as well as to Akamai’s CDN. Yoav has been working on mobile Web performance for longer than he cares to admit. He takes image bloat on the Web as a personal insult, which is why he joined the Responsive Image Community Group and implemented the various responsive images features in Blink and WebKit. When he’s not writing code, he’s probably slapping his bass, mowing the lawn in the French countryside, or playing board games with his family.",
      "image_src": "yoav_weiss",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/yoavweiss"
        },
        {
          "type": "github",
          "url": "https://github.com/yoavweiss"
        },
        {
          "type": "linkedin",
          "url": "https://www.linkedin.com/in/weissyoav/"
        }
      ]
    },
    {
      "first_name": "Martin",
      "last_name": "Splitt",
      "position": "Head of Engineering",
      "company": "Archilogic AG",
      "description": "Martin is pretty decent at humaning and pretty good at computering, so he decided to use his computering to improve his and other's humaning. He is a Google Developer Expert, Mozillian, loves the open web and open source, and aims to make things better with, but not limited to, code.",
      "image_src": "martin_splitt",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/g33konaut"
        },
        {
          "type": "github",
          "url": "https://github.com/AVGP"
        },
        {
          "type": "linkedin",
          "url": "https://www.linkedin.com/in/martinsplitt/"
        }
      ]
    },
    {
      "first_name": "Uri",
      "last_name": "Shaked",
      "position": "Senior Software Engineer",
      "company": "Blackberry",
      "description": "Uri Shaked is a Google Developer Expert for Web Technologies. He regularly writes about Web and IoT related technologies in his medium blog, and speaks about these topics in conferences and meetup around the world. Among his interests are reverse engineering, hardware hacking, building 3D-printed robots and games, playing music and Salsa dancing.",
      "image_src": "uri_shaked",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/urishaked"
        },
        {
          "type": "github",
          "url": "https://github.com/urish"
        },
        {
          "type": "linkedin",
          "url": "https://www.linkedin.com/in/urishaked/"
        }
      ]
    },
    {
      "first_name": "Diego",
      "last_name": "Gonzalez-Zuniga",
      "position": "Senior Engineer",
      "company": "Samsung Research",
      "description": "Diego Gonzalez-Zuniga, PhD (diekus) is a Senior Engineer at Samsung Research UK. He works as a Developer Advocate in the Samsung Internet team. He recently completed his PhD in Informatics researching Stereoscopic Graphical User Interfaces in Barcelona. His main interests are the use of 3D in applications, Graphical User Interfaces, VR, creative uses of technology, video games and gadgets.",
      "image_src": "diego_gonzales",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/dieku"
        }
      ]
    },
    {
      "first_name": "Vitaly",
      "last_name": "Friedman",
      "position": "Co-founder",
      "company": "Smashing Magazine",
      "description": "Vitaly Friedman loves beautiful content and does not give up easily. From Minsk in Belarus, he studied computer science and mathematics in Germany, discovered the passage a passion for typography, writing and design. After working as a freelance designer and developer for 6 years, he co-founded Smashing Magazine, a leading online magazine dedicated to design and web development. Vitaly is the author, co-author and editor of all Smashing books. He currently works as editor-in-chief of Smashing Magazine in the lovely city of Freiburg, Germany.",
      "image_src": "vitaly_friedman",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/smashingmag"
        },
        {
          "type": "github",
          "url": "https://github.com/vitalyfriedman"
        },
        {
          "type": "linkedin",
          "url": "https://www.linkedin.com/in/vitalyfriedman/"
        }
      ]
    },
    {
      "first_name": "Chen Hui",
      "last_name": "Jing",
      "position": "Founder, Director & Design Lead",
      "company": "Wismut Labs",
      "description": "Hui Jing is a self-taught designer and developer from Singapore. Reducing lines of code in her web projects makes her extremely happy. She used to play basketball full-time and launched her web career during downtime between training sessions.",
      "image_src": "chen_hui_jing",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/hj_chen"
        },
        {
          "type": "github",
          "url": "https://github.com/huijing"
        },
        {
          "type": "linkedin",
          "url": "https://sg.linkedin.com/in/huijingchen"
        }
      ]
    },
    {
      "first_name": "Danny",
      "last_name": "Vernovsky",
      "position": "Senior Software Engineer",
      "company": "AT&T",
      "description": "Danny is a senior developer, working in AT&T Israel for the past 4 years. When not wreaking havoc in Warframe, Danny is teaching fellow programmers in a number of internal courses. These days, Danny’s main focus is engineering practices, with an emphasis on the JavaScript ecosystem. Danny is leading a concentrated effort in the company to create a fully automated pipeline, to deliver code from requirements to Production – with the highest possible quality and speed.",
      "image_src": "danny_vernovsky",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/dimkinv"
        },
        {
          "type": "linkedin",
          "url": "https://il.linkedin.com/in/danny-vernovsky-4a35b262"
        }
      ]
    },
    {
      "first_name": "Bret",
      "last_name": "Little",
      "position": "Web Developer",
      "company": "Canopy",
      "description": "Bret is an avid web developer with a background in physics and astronomy. He loves JavaScript and front-end web development. Bret is currently in charge of front-end development at Canopy.",
      "image_src": "bret_little",
      "social_icons": [
        {
          "type": "twitter",
          "url": "https://twitter.com/little_bret"
        },
        {
          "type": "github",
          "url": "https://github.com/blittle"
        },
        {
          "type": "linkedin",
          "url": "https://www.linkedin.com/in/bretlittle/"
        }
      ]
    }
  ]
}