[{
    "first_name": "Richard",
    "last_name": "Feldman",
    "title": "Elm in Action!",
    "image_src": "richard_feldman",
    "text": "Come join Richard Feldman and learn how to build Elm application from zero to production. Find out why people say that learning Elm changed the way they wrote code in other langugages... for the better!",
    "paragraphs": [
        "Richard is a functional programmer who specializes in pushing the limits of browser-based UIs. He’s built seamless-immutable, a JavaScript immutables library that seamlessly interoperates with normal JS collections; elm-css, a CSS preprocessor where you write Elm instead of CSS; and Dreamwriter, a long-form writing Web App written in Elm which works like a desktop app in the absence of an Internet connection.",
        "Write bullet-proof, easily maintainable web applications with Elm, the functional programming language that is transforming web application development. Build an Elm application from start to finish, inter-operate between Elm and JavaScript, organize Elm code using modules and the Elm Architecture and write unit tests for Elm applications.",
        "In this workshop, you will learn functional programming techniques that are useful not only in Elm but in other languages as well."
    ]
}, {
    "first_name": "Brian",
    "last_name": "Holt",
    "title": "React + Redux",
    "image_src": "brian_holt",
    "text": "Get up to speed on building apps using React and Redux, two of very useful tools to have in your toolbox. Learn how to take advantage of these technologies and avoid common pitfalls in order to drive your applications further than ever before.",
    "paragraphs": [
        "Brian Holt is a staff engineer at LinkedIn and a senior user interface engineer at Netflix. This means he’s using JavaScript to enable your (and his own) House of Cards binge watching. Previously, he worked as the director of Redditgifts frontend at Reddit. When not on a Netflix bender or devouring content on Reddit, Brian is probably hanging out with his wife and their dog, running, traveling, or playing video games. Brian is currently a resident of San Francisco, CA.",
        "Surely by now you have heard the buzz surrounding Facebook’s React. More and more people and companies are using it to build large-scale production apps (including at Netflix). Brian Holt guides attendees through an overview of React. In this 2-day training, attendees will go from knowing nothing (or very little) about React to building a whole app using React and Redux.",
        "React has some neat bells and whistles, like virtual DOM and the speed at which it can render content to the DOM and update it thereafter. However, these are not the most compelling reasons to use React. React introduced some fundamental concepts to the frontend development world, chief among them Flux and one-way data flow. Brian outlines how you can take these concepts and apply them to any code you’re writing.",
        "In addition to covering how to write user interfaces using React, Brian will explore managing data using Redux. Redux is a great library from Dan Abramov that makes managing data stores very simple. We will discuss how to use Redux to make Flux-like stores."
    ]
}]